/* same item display name suffix format */
" (%lu)" = " (%lu)";

/* Bone from other model */
"%@ (%@)" = "%1$@ (%2$@)";

/* render window title format */
"%@ - Render view %lu" = "%1$@ - Render view %2$lu";

/* camera target name format */
"%@ — %@" = "%1$@ — %2$@";

/* DDS: Unknown alpha bitcount */
"%u bits per pixel with alpha are not supported." = "%u bits per pixel with alpha are not supported.";

/* DDS: Unknown non-alpha bitcount */
"%u bits per pixel without alpha are not supported." = "%u bits per pixel without alpha are not supported.";

/* Vertex index out of range error */
"A mesh references vertices that do not exist." = "A mesh references vertices that do not exist.";

/* Premature end of file error. */
"A model has to be at least eight bytes long. This file may be corrupted." = "A model has to be at least eight bytes long. This file may be corrupted.";

/* uncompress failed */
"A piece of compressed data was shorter than it should have been. The file may be damaged" = "A piece of compressed data was shorter than it should have been. The file may be damaged";

/* load mesh undo action name */
"Add item" = "Add item";

/* The parent index of this bone is invalid. */
"All bones have to have a parent that exists or no parent at all." = "All bones have to have a parent that exists or no parent at all.";

/* source view - lights */
"Ambient" = "Ambient";

/* Bone index out of range error */
"An index in the bone references is out of range" = "An index in the bone references is out of range";

/* Vertex index out of range error */
"An index in the graphics data is out of range" = "An index in the graphics data is out of range";

/* export: has such mtl already */
"An MTL file with this name already exists" = "An MTL file with this name already exists";

/* export: suffix = mtl */
"As part of the export, an .mtl file will be generated automatically. This will overwrite an existing file of the same name." = "As part of the export, an .mtl file will be generated automatically. This will overwrite an existing file of the same name.";

/* export: suffix = mtl */
"As part of the export, an .mtl file will be generated automatically. To avoid clashes, do not use .mtl as an extension." = "As part of the export, an .mtl file will be generated automatically. To avoid clashes, do not use .mtl as an extension.";

/* Found a circle in the bone relationships. */
"Bone \"%@\" has itself as an ancestor." = "Bone \"%@\" has itself as an ancestor.";

/* source view header */
"Bones" = "Bones";

/* Undo: data of camera has changed. */
"Camera changed" = "Camera changed";

/* export: cancel */
"Cancel" = "Cancel";

/* Context creation failed */
"Could not create an OpenGL 3.2 Core Profile context." = "Could not create an OpenGL 3.2 Core Profile context.";

/* uncompress failed */
"Could not decompress part of the data." = "Could not decompress part of the data.";

/* can't write meshes without tangents
   no mesh group found for model to export */
"Could not export model." = "Could not export model.";

/* DDSOpenData returned NULL */
"DDS File %@ couldn't be opened: %@" = "DDS File %1$@ couldn't be opened: %2$@";

/* delete item undo action name */
"Delete item" = "Delete item";

/* Bundle didn't find Modelparams file. */
"Did not find model parameters for model type %@" = "Did not find model parameters for model type %@";

/* source view - lights */
"Diffuse %@" = "Diffuse %@";

/* Tried to load unsupported format */
"Files of type %@ are not supported." = "Files of type %@ are not supported.";

/* Context creation failed */
"GLLara requires graphics cards that support OpenGL 3.2 or higher." = "GLLara requires graphics cards that support OpenGL 3.2 or higher.";

/* Bundle didn't find Modelparams file. */
"GLLara stores special information for files not named generic_item. This information is not available" = "GLLara stores special information for files not named generic_item. This information is not available";

/* DDS: Unknown FourCC */
"Graphics format %4s is not supported." = "Graphics format %4s is not supported.";

/* DDS: Unknown 16-bit alpha format
   DDS: Unknown 16-bit non-alpha format
   DDS: Unknown 24-bit non-alpha format
   DDS: Unknown 32-bit alpha format */
"Graphics format is not supported." = "Graphics format is not supported.";

/* New-style binary generic item won't work. */
"If there is a .mesh.ascii version, try opening that." = "If there is a .mesh.ascii version, try opening that.";

/* source view header */
"Items" = "Items";

/* source view header */
"Lights" = "Lights";

/* load child model undo action name */
"Load outift" = "Load outift";

/* load pose undo action name */
"Load pose" = "Load pose";

/* load texture pack undo action name */
"Load texture pack" = "Load texture pack";

/* source view header */
"Meshes" = "Meshes";

/* can't write meshes without tangents */
"Meshes that originally had no tangents cannot be exported at this time." = "Meshes that originally had no tangents cannot be exported at this time.";

/* No comment provided by engineer. */
"Message from OpenGL driver: %s" = "Message from OpenGL driver: %s";

/* Generic Item 2: Second uint32 unexpected */
"New-style Generic Item has unknown major version." = "New-style Generic Item has unknown major version.";

/* Generic Item 2: Second uint32 unexpected */
"New-style Generic Item has unknown minor version for major version 1." = "New-style Generic Item has unknown minor version for major version 1.";

/* Generic Item 2: Second uint32 unexpected */
"New-style Generic Item has unknown minor version for major version 2." = "New-style Generic Item has unknown minor version for major version 2.";

/* can't write meshes without tangents */
"No XNALara Mesh Group number corresponds to the shader %@." = "No XNALara Mesh Group number corresponds to the shader %@.";

/* export: suffix = mtl */
"OBJ files cannot use .mtl as extension" = "OBJ files cannot use .mtl as extension";

/* Tried to load unsupported format */
"Only .mesh, .mesh.ascii and .obj files can be loaded." = "Only .mesh, .mesh.ascii and .obj files can be loaded.";

/* DDS: Unknown graphics format */
"Only DXT1,3,5 and uncompressed (A)RGB formats are supported." = "Only DXT1,3,5 and uncompressed (A)RGB formats are supported.";

/* Loading error: No parameters for this model. */
"Parameters for file could not be found." = "Parameters for file could not be found.";

/* The parent index of this bone is invalid. */
"Parent of bone \"%@\" does not exist." = "Parent of bone \"%@\" does not exist.";

/* No shader there wtf? */
"Please inform a developer of this problem." = "Please inform a developer of this problem.";

/* error loading pose old-style */
"Pose file does not contain the right amount of bones" = "Pose file does not contain the right amount of bones";

/* error loading pose old-style */
"Poses in the old format have to contain exactly as many items as bones. Try using a newer pose." = "Poses in the old format have to contain exactly as many items as bones. Try using a newer pose.";

/* Only bone in a boneless format */
"Root bone" = "Root bone";

/* source view header */
"Settings" = "Settings";

/* Found a circle in a bone relationship */
"The bones would form an infinite loop." = "The bones would form an infinite loop.";

/* uncompress failed */
"The compressed parts of the file could not be processed. The file may be damaged." = "The compressed parts of the file could not be processed. The file may be damaged.";

/* Premature end of file error */
"The file breaks off during the descriptions of a mesh. Maybe it is damaged?" = "The file breaks off during the descriptions of a mesh. Maybe it is damaged?";

/* Premature end of file error */
"The file breaks off in the middle of the bones section. Maybe it is damaged?" = "The file breaks off in the middle of the bones section. Maybe it is damaged?";

/* Premature end of file error */
"The file breaks off in the middle of the meshes section. Maybe it is damaged?" = "The file breaks off in the middle of the meshes section. Maybe it is damaged?";

/* Premature end of file error */
"The file breaks off inside a mesh's vertex data" = "The file breaks off inside a mesh's vertex data";

/* DDS: Does not start with DDS */
"The file cannot be opened because it has an incorrect start sequence. This usually indicates that the file is damaged or not a DDS file at all." = "The file cannot be opened because it has an incorrect start sequence. This usually indicates that the file is damaged or not a DDS file at all.";

/* DDS: Unknown FourCC */
"The file cannot be read because it uses a compressed data format that is not supported. Only DXT1, DXT3 and DXT5 formats are supported." = "The file cannot be read because it uses a compressed data format that is not supported. Only DXT1, DXT3 and DXT5 formats are supported.";

/* DDS: Header size wrong */
"The file cannot be read because it uses a different header size than normal. This may be because it uses a newer version of the file format, or because it is damaged." = "The file cannot be read because it uses a different header size than normal. This may be because it uses a newer version of the file format, or because it is damaged.";

/* DDS: Pixel format size wrong */
"The file cannot be read because it uses a different pixel format size than normal. This may be because it uses a newer version of the file format, or because it is damaged." = "The file cannot be read because it uses a different pixel format size than normal. This may be because it uses a newer version of the file format, or because it is damaged.";

/* Premature end of file error */
"The file contains only bones and no meshes. Maybe it was damaged?" = "The file contains only bones and no meshes. Maybe it was damaged?";

/* Premature end of file error */
"The file is missing some data." = "The file is missing some data.";

/* Premature end of file error */
"The file is shorter than the minimum file size." = "The file is shorter than the minimum file size.";

/* Bone index out of range error */
"The file references bones that do not exist." = "The file references bones that do not exist.";

/* DDS: Unknown 32-bit format */
"The file uses a data layout that is not supported. Only ARGB is supported for 32 bit uncompressed textures." = "The file uses a data layout that is not supported. Only ARGB is supported for 32 bit uncompressed textures.";

/* DDS: Unknown 16-bit alpha format */
"The file uses a data layout that is not supported. Only ARGB4 and ARGB1555 are supported for 16 bit uncompressed textures with alpha channel." = "The file uses a data layout that is not supported. Only ARGB4 and ARGB1555 are supported for 16 bit uncompressed textures with alpha channel.";

/* DDS: Unknown 24-bit non-alpha format */
"The file uses a data layout that is not supported. Only RGB is supported for 24 bit uncompressed textures." = "The file uses a data layout that is not supported. Only RGB is supported for 24 bit uncompressed textures.";

/* DDS: Unknown 16-bit non-alpha format */
"The file uses a data layout that is not supported. Only RGB565 is supported for 16 bit uncompressed textures without alpha." = "The file uses a data layout that is not supported. Only RGB565 is supported for 16 bit uncompressed textures without alpha.";

/* DDS: Unknown 32-bit alpha format */
"The file uses a data layout that is not supported. Only XRGB is supported for 32 bit uncompressed textures with alpha." = "The file uses a data layout that is not supported. Only XRGB is supported for 32 bit uncompressed textures with alpha.";

/* DDS: Unknown alpha bitcount */
"The file uses a data layout that is not supported. Uncompressed formats with alpha have to be 32 or 16 bits per pixel." = "The file uses a data layout that is not supported. Uncompressed formats with alpha have to be 32 or 16 bits per pixel.";

/* DDS: Unknown non-alpha bitcount */
"The file uses a data layout that is not supported. Uncompressed formats without alpha have to be 32, 24 or 16 bits per pixel." = "The file uses a data layout that is not supported. Uncompressed formats without alpha have to be 32, 24 or 16 bits per pixel.";

/* DDS: Unknown graphics format */
"The file's graphics format is not supported." = "The file's graphics format is not supported.";

/* Premature end of file error */
"The Generic Item 2 footer section is incomplete. The file may be damaged." = "The Generic Item 2 footer section is incomplete. The file may be damaged.";

/* Premature end of file error */
"The mesh data is incomplete. The file may be damaged." = "The mesh data is incomplete. The file may be damaged.";

/* GLLShader error message description */
"The shader \"%@\" could not be compiled properly" = "The shader \"%@\" could not be compiled properly";

/* GLLShader error message description */
"The shader \"%@\" could not be linked" = "The shader \"%@\" could not be linked";

/* GLLShader no source message description */
"The source code shader \"%@\" could not be found" = "The source code shader \"%@\" could not be found";

/* Premature end of file error */
"The vertex data for a mesh could not be loaded." = "The vertex data for a mesh could not be loaded.";

/* DDS: Does not start with DDS */
"This DDS file is corrupt." = "This DDS file is corrupt.";

/* DDS: Header size wrong
   DDS: Pixel format size wrong */
"This DDS file is not supported." = "This DDS file is not supported.";

/* Loading error: No parameters for this model. */
"This file is neither a generic item nor a known named file." = "This file is neither a generic item nor a known named file.";

